//
//  HomeWork.swift
//  6.1 View debugger
//
//  Created by Igor Frik on 22.08.2022.
//

import Foundation
/*
 
4. Примеры в LeakedViewController

5. Поставить breakpoint, и при остановке в консоле прописать "po"  + имя свойства. Можно прописать эту команду  в настроках breakpoint для автоматического вывода в консоль.

6. При остановке breakpoint, или в настройках breakpoint прописать "expression" + имя свойства = новое значение.

7. Используется watchpoint, который ставится через выбор пунк ""Watch" у выбраного свойства.
 
8. Не совсем понимаю вопрос задания. Судя по всему с использованием "Time profiler" для отслеживание времени выполнения всех функций. Либо "Memory graf" - там видны все взаимосваязи, в том числе с системными функциями.
 
9. Allocations - Дает  подробную информацию о всех создающихся объектах и памяти, которая поддерживает их. Он Также показывает оставшиеся связи каждого объекта.
Leaks - Используется, чтобы найти утечки памяти первого рода, когда на объект больше нет ссылок, а он занимает память.
Activity Monitor - Мониторит нагрузку на ЦП, оперативку, диск и сетевую активность.
CPU profiler - Более подробная информация о нагрузке на ЦП.
Metal System Trace - Отслеживание производительности приложений с использованием Metal.
Network - Анализ HTTP запросов, и использование TCP/IP UDP/IP соединений.
Core data - Отслеживает активность файловой системы Core Data.
 
*/
